tutorials/06NonIsothermalMixingElbow/0/Ulift1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2200
(
(3.59321e-06 8.99733e-07 0)
(3.6036e-06 2.62702e-06 0)
(3.61127e-06 4.47815e-06 0)
(3.59681e-06 6.77219e-06 0)
(3.53046e-06 9.6009e-06 0)
(3.37197e-06 1.30148e-05 0)
(3.0706e-06 1.69652e-05 0)
(2.57111e-06 2.12106e-05 0)
...
)
;

boundaryField
{
    wall-4
    {
        type            noSlip;
    }
    pressure-outlet-7
    {
        type            zeroGradient;
    }
    velocity-inlet-6
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }
    velocity-inlet-5
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
